/****************************************************
 * 작성일 : 2019-06-29
 * 전화 : 010-3322-4495
 * 이메일 : kimchiman91@naver.com
 *****************************************************/

/*****************************************************
 * 상수 선언부
 *****************************************************/



/*****************************************************
 * 이벤트함수 선언부
 *****************************************************/




/*****************************************************
 * 일반함수 선언부
 *****************************************************/



/*
 * description : 제이쿼리 엔진을 로드하고 캘린더 태그를 초기화한다.
 * param : 
 * return : 초기화 성공(true/false)
 * 작성일 : 2019-06-29
 */
function init()
{
    alert("init 호출");
    st1.rto = new Apple();
    
}

var st = {
    asd : "감자",
    ddd : "고구마",
    rto : null
}

function Apple (type) {
    this.type = type;
    this.color = "red";
}
 
Apple.prototype.getInfo = function() {
    return this.color + ' ' + this.type + ' apple';
};
